In [1]:
a=7
b=5

### Exemplo de soma

In [2]:
c=a+b
print(c)

12

In [6]:
import pandas as pd
import psycopg2 as pg

In [8]:
con = pg.connect(host= 'localhost',
                dbname = 'Clinica_FBD',
                user = 'postgres',
                password = 'postgres')

In [9]:
nome = 'Vitor Hugo'
cpf = '10089687302'
sexo = 'M'
nascimento = '02-04-2005'
salario = 20000.00

In [10]:
cursor = con.cursor()

In [61]:
cursor.execute(
    'insert into pessoa (nome, cpf, sexo, nascimento, salario) values (%s, %s, %s, %s, %s)',
    (nome, cpf, sexo, nascimento, salario)
)

UndefinedColumn: ERRO:  não existe a coluna "nome" da relação "pessoa"
LINE 1: insert into pessoa (nome, cpf, sexo, nascimento, salario) va...
                            ^

In [22]:
con.commit()

In [62]:
cursor.execute('select * from pessoa;')
cursor.fetchall()

[(1, 'Lucas', 'Oliveira', 'M', datetime.date(2005, 2, 4), 'Ceará'),
 (2, 'Beatriz', 'Santos', 'F', datetime.date(1990, 7, 2), 'Rio de Janeiro'),
 (3, 'Miguel', 'Pereira', 'M', datetime.date(1982, 11, 10), 'Belo Horizonte'),
 (4, 'Sofia', 'Costa', 'F', datetime.date(1995, 2, 5), 'Curitiba'),
 (5, 'Gabriel', 'Almeida', 'M', datetime.date(1988, 9, 30), 'Porto Alegre'),
 (6, 'Alice', 'Silva', 'F', datetime.date(1993, 12, 18), 'Salvador'),
 (7, 'Pedro', 'Souza', 'M', datetime.date(1987, 10, 25), 'Fortaleza'),
 (8, 'Laura', 'Martins', 'F', datetime.date(1992, 4, 3), 'Recife'),
 (9, 'Rafael', 'Lima', 'M', datetime.date(1984, 10, 2), 'Brasília'),
 (10, 'Ana', 'Carvalho', 'F', datetime.date(1996, 1, 27), 'Campinas'),
 (1, 'Carlos', 'Mendes', 'M', datetime.date(1978, 9, 12), 'Fortaleza'),
 (2, 'Mariana', 'Lima', 'F', datetime.date(1992, 11, 7), 'Campinas'),
 (3, 'Fernando', 'Souza', 'M', datetime.date(1985, 4, 21), 'Curitiba'),
 (4, 'Juliana', 'Costa', 'F', datetime.date(1990, 6, 30), 'Salvador'),
 (5, 'Gabrila', 'Rocha', 'F', datetime.date(1988, 2, 9), 'Porto Alegre'),
 (1, 'Roberto', 'Almeida', 'M', datetime.date(1975, 7, 3), 'São Paulo'),
 (2,
  'Fernanda',
  'Oliveira',
  'F',
  datetime.date(1980, 11, 16),
  'Rio de Janeiro'),
 (3, 'Pedro', 'Carvalho', 'M', datetime.date(1978, 4, 25), 'Belo Horizonte'),
 (4, 'Laura', 'Pereira', 'F', datetime.date(1985, 8, 29), 'Curitiba'),
 (5,
  'Marcelo',
  'Nascimento',
  'M',
  datetime.date(1969, 12, 11),
  'Porto Alegre')]

In [57]:
cursor.execute('ROLLBACK')

In [58]:
try:
    cursor.execute(
    'insert into pessoa (nome, cpf, sexo, nascimento, salario) values (%s, %s, %s, %s, %s)',
    (nome, cpf, sexo, nascimento, salario))
    con.commit()
    print('Sucesso!')
except:
    cursor.execute('ROLLBACK')
    print('Falhou!')

Falhou!

In [63]:
cursor.close()
con.close()

In [64]:
import sqlalchemy
from sqlalchemy import create_engine

In [66]:
con2 = 'postgresql://postgres:postgres@localhost/Clinica_FBD'
sqlalchemy.create_engine(con2)

Engine(postgresql://postgres:***@localhost/Clinica_FBD)

In [67]:
query = "select * from pessoa"
df = pd.read_sql_query(query, con2)

In [68]:
df

    id     pnome       unome genero   data_nasc        endereco
0    1     Lucas    Oliveira      M  2005-02-04           Ceará
1    2   Beatriz      Santos      F  1990-07-02  Rio de Janeiro
2    3    Miguel     Pereira      M  1982-11-10  Belo Horizonte
3    4     Sofia       Costa      F  1995-02-05        Curitiba
4    5   Gabriel     Almeida      M  1988-09-30    Porto Alegre
5    6     Alice       Silva      F  1993-12-18        Salvador
6    7     Pedro       Souza      M  1987-10-25       Fortaleza
7    8     Laura     Martins      F  1992-04-03          Recife
8    9    Rafael        Lima      M  1984-10-02        Brasília
9   10       Ana    Carvalho      F  1996-01-27        Campinas
10   1    Carlos      Mendes      M  1978-09-12       Fortaleza
11   2   Mariana        Lima      F  1992-11-07        Campinas
12   3  Fernando       Souza      M  1985-04-21        Curitiba
13   4   Juliana       Costa      F  1990-06-30        Salvador
14   5   Gabrila       Rocha      F  1988-02-09    Porto Alegre
15   1   Roberto     Almeida      M  1975-07-03       São Paulo
16   2  Fernanda    Oliveira      F  1980-11-16  Rio de Janeiro
17   3     Pedro    Carvalho      M  1978-04-25  Belo Horizonte
18   4     Laura     Pereira      F  1985-08-29        Curitiba
19   5   Marcelo  Nascimento      M  1969-12-11    Porto Alegre

In [72]:
query2 = "SELECT COUNT(*) FROM pessoa;"

df2 = pd.read_sql_query(query2, con2)
df2

   count
0     20

In [75]:
query3 = "SELECT * FROM pessoa WHERE endereco = 'Curitiba';"

df3 = pd.read_sql_query(query3, con2)
df3.head()

   id     pnome    unome genero   data_nasc  endereco
0   4     Sofia    Costa      F  1995-02-05  Curitiba
1   3  Fernando    Souza      M  1985-04-21  Curitiba
2   4     Laura  Pereira      F  1985-08-29  Curitiba